{   
    "perfil":{
        "nombre1":"Chipana",
        "nombre2":"Gerardo",
        "especialidad1":"Desarrollador Web",
        "especialidad2":"Full stack",
        "presentacion":"Soy una persona ingeniosa y dinámica, enfocada en mis metas, comprometida con cada tarea que realizo, con entusiasmo por crecer profesionalmente. Sé mantener la calma y actuar con eficacia en momentos de urgencia, resolviendo desafíos y generando ideas innovadoras."
    },
    "redes":{
        "whatsapp":"https://wa.me/51990875807",
        "github":"https://github.com/GerardoMelvinChipanaGutirrrez",
        "linkeding":"https://www.linkedin.com/in/gerardo-melvin-chipana-gutierrez-64b452216/",
        "email":"mailto:gerardoddat@gmail.com"
    },
    "habilidades":["Liderazgo","Creatividad","Cooperación","Oratoria"],
    "habilidadesProfesionales":["Python","Django","Flask","Javascript","PHP","HTML","CSS","Git","SQL","ProstgreSQL","NodeJS","React","Angular","Sass","Java","Pandas","Tailwind","Bootstrap","Power Bi","Excel"],
    "experiencia":{
        "0":{
            "ubicacion":"Desarrollador web - fullstack",
            "titulo":"EJERCITO DEL PERU - COEDE",
            "fecha":"Abr 2023 - Dic 2023",
            "Descrip":"Desarrollé un aplicativo web de atención al cliente para el área de soporte técnico del departamento de telecomunicaciones ubicado en el COEDE. Realicé la mayoría del proyecto llamado “YANAPUKUY”, desde la estructura de la base de datos, el diseño de la página, el desarrollo de las interfaces, el sistema de consultas a la base de datos y las funciones CRUD."
        },
        "1":{
            "ubicacion":"Desarrollador web - fullstack",
            "titulo":"Digital BUHO",
            "fecha":"Sep 2022 - Abril 2023",
            "Descrip":"Desarrollaba pequeñas funciones en varios proyectos en equipo, como un sistema de mensajería, el scrapping de páginas e-commerce, login de seguridad y reCAPTCHA. La empresa se dedicaba a crear páginas corporativas, brindar asesoramiento al respecto y gestionar correos corporativos."
        },
        "3":{
            "ubicacion":"Desarrollador de software",
            "titulo":"Trabajo independiente",
            "fecha":"Sep 2023 - Abril 2024 / Ago 2024 - Actualidad",
            "Descrip":"Trabajo independiente en el que desarrollé algunos proyectos, como una página CRUD, aplicaciones de consumo de API, un sistema de ventas y otros proyectos personales."
        }
    },
    "proyectos":{
        "0":{
            "name":"Yanapukuy",
            "img":"file/proyectos/yanapukuy.png",
            "url":"",
            "frontDescrip":"Aplicación dedicado a la generación, gestion y seguimiento de ticket además para el área de soporte TI.",
            "BackDescrip":"Programa dedicado a la generación, gestión y seguimiento de tickets de consultas al área de soporte técnico de un departamento del Ejército que brinda asistencia a los trabajadores. Cuenta con base de datos, sistema de acceso, tablas dinámicas, manejo de datos y consulta de estado. Desarrollado en <b>PHP y MySQL</b>."
        },
        "1":{
            "name":"listAPPpy",
            "img":"file/proyectos/ListPY.png",
            "url":"https://listapppy.onrender.com/",
            "frontDescrip":"Aplicacion web de consultas de datos de asistencia atraves de google api para <b>solicitar informacion de una tabla excel utilizando Flask de py</b>.",
            "BackDescrip":"Aplicación web de consultas para visualizar la coordinación o lista de elementos en una tabla dinámica de Google Sheets, utilizando tecnologías como <b>Flask</b> para el manejo de consultas POST y Google APIs para un cliente."
        },
        "3":{
            "name":"Compumax",
            "img":"file/proyectos/compumax.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Compumax",
            "frontDescrip":"Interfaz principal de una pagina e-comers de una tienda de tecnologia, maquetado y desarrollado en <b>React</b>.",
            "BackDescrip":"Interfaz principal de una pagina e-comers de una tienda de tecnologia, maquetado y desarrollado en <b>React</b> conm funcionalidades como login, carrito de venta, catalogo, vista de producto y vista de lista de proctos."
        },
        "2":{
            "name":"Login de banca por internet",
            "img":"file/proyectos/acceso-de-seguridad.png",
            "url":"https://github.com/MichelBalvinOrmedo1/bancaPorInternet",
            "frontDescrip":"Front que trata de replicar el acceso de un banco imaginaro.",
            "BackDescrip":"Clon de programa de acceso bancario, trabajado en equipo el cual cuenta con algunas funciones de seguridad como recapcha, bloqueo de input,auto completado, teclado númerico aleatorio para el aprendisaje del equipo."
        },
        "4":{
            "name":"sistema Post",
            "img":"file/proyectos/sistemaPost.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Fluppy-bird-clone",
            "frontDescrip":"Sistema post y almacenamiento de datos en <b>Visual Studio Aplication</b> para un pequeño negocio de ventas electronicas.",
            "BackDescrip":"Sistema dedicado al inventario, proceso de venta y elavoración de boleta en <b>Visual Studio Aplication</b> para un pequeño negocio dedicado al ambito tecnologico."
        },
        "10":{
            "name":"Clon-fluppy-bird",
            "img":"file/proyectos/fluppy.jpg",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Fluppy-bird-clone",
            "frontDescrip":"Aplicativo dedicado al aplendizaje, desarrollado en <b>React</b> y utilizando el entorno de <b>Phaser</b>, basado en el juego de fluppy bird.",
            "BackDescrip":"Aplicativo dedicado al aplendizaje, especificamente para logra terminar un curso certificado, desarrollado en <b>React</b> y utilizando el entorno de <b>Phaser</b>, basado en el juego de fluppy bird."
        },
        "7":{
            "name":"Calculadora",
            "img":"file/proyectos/calculadora.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Calculadora",
            "frontDescrip":"Ejercicio desarrollado en React utilizando objetos como parte de aprendisaje.",
            "BackDescrip":"Ejercicio desarrollado en React utilizando objetos como parte de aprendisaje."
        },
        "6":{
            "name":"Pokedex-con- react",
            "img":"file/proyectos/pokeapi.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Pokedex-React",
            "frontDescrip":"Ejercicio desarrollado en React como parte de aprendisaje.",
            "BackDescrip":"Ejercicio desarrollado en React como parte de aprendisaje."
        },
        "5":{
            "name":"Money-camb",
            "img":"file/proyectos/cambia-camb.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Money-camb",
            "frontDescrip":"Pequeño programa de consulta de divisas, desarrollado en <b>React</b>.",
            "BackDescrip":"Pequeño programa de consulta de divisas, desarrollado en <b>React</b> que jala sus recursos para las operaciones de cambio de moneda de una json."
        },
        "8":{
            "name":"Gifsapp",
            "img":"file/proyectos/gif-app.png",
            "url":"https://github.com/GerardoMelvinChipanaGutirrrez/Gif-app",
            "frontDescrip":"Aplicativo de angular creado como ejercicio de aprendisaje personal que se enfoca en el consumo de apis rest.",
            "BackDescrip":"Prueba tecnica de uso de tecnologias como angular, y api rest."
        }
    }
}